Revit 2027 API
EnergyAnalysisMaterial.ThermalConductivity Property
 The thermal conductivity of the material, kg*ft/(k*s^3).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ThermalConductivity { get; }
Public ReadOnly Property ThermalConductivity As Double
	Get
public:
property double ThermalConductivity {
	double get ();
}
member ThermalConductivity : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace